Охотники_и_рыболовы/src/InformationRegisters/ОхотничьиБилеты/ОхотничьиБилеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОхотничьиБилеты</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарегистрированВ</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
      <types>CatalogRef.ОрганыВыдачиГосБилетов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КемВыдан</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаЛишения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияЛишения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Причина</name>
    <type>
      <types>EnumRef.ПричиныНедействительностиБилета</types>
    </type>
  </attributes>
  <dimensions>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидБилета</name>
    <type>
      <types>EnumRef.ВидыОхотничьихБилетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лишен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/Enums/ВидыОхотничьихБилетов/ВидыОхотничьихБилетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОхотничьихБилетов</name>
  <enumValues>
    <name>ГосБилет</name>
    <comment>Охотничий билет Российской Федерации</comment>
  </enumValues>
  <enumValues>
    <name>ЧленскийБилет</name>
    <comment>Членский охотничье-рыболовный билет</comment>
  </enumValues>
</mdclass:Enum>

Охотники_и_рыболовы/src/InformationRegisters/ОхотничьиБилеты/RecordSetModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ЧленскийБилет = ПредопределенноеЗначение("Перечисление.ВидыОхотничьихБилетов.ЧленскийБилет");
	
	Если ЭтотОбъект.Отбор.ВидБилета.Значение = ЧленскийБилет Тогда
		ПроверяемыеРеквизиты.Добавить("КемВыдан");
	КонецЕсли;	
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЭтотОбъект.Количество() > 0 Тогда
		Если НЕ ЭтотОбъект.Отбор.Действует.Значение Тогда
			Возврат;
		КонецЕсли;	
		
		ВидБилета = ЭтотОбъект.Отбор.ВидБилета.Значение;
		Охотник = ЭтотОбъект.Отбор.Охотник.Значение;
		Исключен = ЭтотОбъект.Отбор.Исключен.Значение;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО(ОхотничьиБилеты.Действует) КАК КоличествоДействующих,
			|	МАКСИМУМ(ОхотничьиБилеты.Исключен) КАК Исключен
			|ИЗ
			|	РегистрСведений.ОхотничьиБилеты КАК ОхотничьиБилеты
			|ГДЕ
			|	ОхотничьиБилеты.Охотник = &Охотник
			|	И ОхотничьиБилеты.ВидБилета = &ВидБилета
			|	И ОхотничьиБилеты.Действует = ИСТИНА
		    |   И  ОхотничьиБилеты.Исключен = &Исключен";
		Запрос.УстановитьПараметр("ВидБилета", ВидБилета);
		Запрос.УстановитьПараметр("Охотник", Охотник);
		Запрос.УстановитьПараметр("Исключен", Исключен);

		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.КоличествоДействующих > 1 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя создавать два и более действующих билета",,,,Отказ);				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
